<a href="https://colab.research.google.com/github/yotam-biu/tutorial8/blob/main/pandas_basic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

base on: "https://geobgu.xyz/py/pandas1.html"

In [1]:
import pandas as pd
import numpy as np

# 1
Craete series and data-frame

## 1.1
Run the next cell to create a Pandas Series (a column of data) without a header. Your task is to find a way to add a header to this column.
*italicized text*

In [4]:
name = pd.Series(['Beer-Sheva Center', 'Beer-Sheva University', 'Dimona']) # a column of names
# add header to the column
name.name = 'Name'
print(name)

0        Beer-Sheva Center
1    Beer-Sheva University
2                   Dimona
Name: Name, dtype: object


## 1.2
The next cell creates a DataFrame that does not include a column for city values. Your task is to add a new column named "city" to the DataFrame and populate it with the city values **after the table has been created**.

In [6]:
lines = np.array([4, 5, 1])
city = ['Beer-Sheva', 'Beer-Sheva', 'Dimona']
piano = [False, True, False]
lon = [34.798443, 34.812831, 35.011635]
lat = [31.243288, 31.260284, 31.068616]


data = {'name': name, 'lines': lines, 'piano': piano, 'lon': lon, 'lat': lat}
stations = pd.DataFrame(data)
stations
# add new column to the dataframe named 'city'
stations['city'] = city
stations

                    name  lines  piano        lon        lat        city
0      Beer-Sheva Center      4  False  34.798443  31.243288  Beer-Sheva
1  Beer-Sheva University      5   True  34.812831  31.260284  Beer-Sheva
2                 Dimona      1  False  35.011635  31.068616      Dimona

## 1.3
Create a new row with made-up values and add it to the DataFrame.

In [8]:
# new row
new_station = pd.Series({'name': 'Arad', 'lines': 1, 'piano': False, 'lon': 35.206826, 'lat': 31.261101, 'city': 'Arad'})
stations = pd.concat([stations, new_station], axis=1).T
stations

,0,1,2,name,lines,piano,lon,lat,city
name,Beer-Sheva Center,Beer-Sheva University,Dimona,NaN,NaN,NaN,NaN,NaN,NaN
lines,4.0,5.0,1.0,NaN,NaN,NaN,NaN,NaN,NaN
piano,False,True,False,NaN,NaN,NaN,NaN,NaN,NaN
lon,34.798443,34.812831,35.011635,NaN,NaN,NaN,NaN,NaN,NaN
lat,31.243288,31.260284,31.068616,NaN,NaN,NaN,NaN,NaN,NaN
city,Beer-Sheva,Beer-Sheva,Dimona,NaN,NaN,NaN,NaN,NaN,NaN
0,NaN,NaN,NaN,Arad,1,False,35.206826,31.261101,Arad

## 1.4
Determine the four data types (`dtypes`) of the columns in the DataFrame.  

**Hint:** You can use the DataFrame's built-in attribute `dtypes` to check the data types of all columns.**bold text**

In [9]:
print(stations.dtypes)

0        object
1        object
2        object
name     object
lines    object
piano    object
lon      object
lat      object
city     object
dtype: object

# 2
Change a value

## 2.1
The Beer-Sheva University train station has added a piano. Update the DataFrame to reflect this change by modifying the value in the "piano" column for the relevant row from False to True.

**Hint**: You can use `.at` to update a specific cell value efficiently when you know the exact row index and column name.

```python
df.at[row_index, column_name] = new_value
```

## 2.2
Assign new values to the entire lines column in two ways:
1. **Different values for each item**:  
   You can assign a list or array of values with the same length as the column.
2. **The same value for all items**:  
   Assign a single value to the entire column.
   ```

In [10]:
print(pd.__version__)

2.2.3


## 2.3
Create a new column named "cafe" in the DataFrame to indicate whether the station has a cozy café. You can assign values directly, such as True for stations with a café and False otherwise.

# 3
Load data-frame

## **Mission:**  
3.1. Save the current DataFrame as a CSV or Excel file.  
3.2. Open the saved file in a text editor or spreadsheet software (such as Excel), make a small change to the data, and save the file.  
3.3. Reload the modified file back into a DataFrame and inspect the contents to ensure the changes were applied correctly.  

**Hints:**  
- To save as CSV: `df.to_csv('filename.csv', index=False)`  
- To save as Excel: `df.to_excel('filename.xlsx', index=False)`  
- To reload a CSV: `pd.read_csv('filename.csv')`  
- To reload an Excel file: `pd.read_excel('filename.xlsx')`